<!-- dflook/terraform-github-actions {"workspace":"dev","backend_type":"azurerm","backend":"dd33378b7de5d4e14d79609bffaa13460e19006e9a2d98cd596ccedbb87b43f2","plan_job_ref":"Job ci cd #15 at https://github.com/HossainAhnaf/otel-ecommerce-infra/actions/runs/16434666486","plan_out_hash":"face0b2b9c357bef506207483bb86bb5edb6ce183bc3e3875cacc424dd014f72","plan_hash":"bb42837414e3534259637d1ad0ef7a8df6bc20e9652920c7e09a67b5359a4f48","plan_text_format":"diff","version":"2.1.0"} -->
Terraform plan in __.__ in the __dev__ workspace
With var files: `dev.tfvars`
<details>
<summary>Plan: 13 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
 <= read (data resources)

Terraform will perform the following actions:

  # azurerm_resource_group.main will be created
+   resource "azurerm_resource_group" "main" {
+       id       = (known after apply)
+       location = "eastus"
+       name     = "rg-otel-ecommerce-dev-eastus"
    }

  # random_id.prefix will be created
+   resource "random_id" "prefix" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 4
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

  # module.aks.data.azurerm_client_config.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "this" {
+       client_id       = (known after apply)
+       id              = (known after apply)
+       object_id       = (known after apply)
+       subscription_id = (known after apply)
+       tenant_id       = (known after apply)
    }

  # module.aks.data.azurerm_resource_group.aks_rg[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "aks_rg" {
+       id         = (known after apply)
+       location   = (known after apply)
+       managed_by = (known after apply)
+       name       = "rg-otel-ecommerce-dev-eastus"
+       tags       = (known after apply)
    }

  # module.aks.azapi_update_resource.aks_cluster_post_create will be created
+   resource "azapi_update_resource" "aks_cluster_post_create" {
+       body                    = {
+           properties = {
+               kubernetesVersion = null
            }
        }
+       id                      = (known after apply)
+       ignore_casing           = false
+       ignore_missing_property = true
+       name                    = (known after apply)
+       output                  = (known after apply)
+       parent_id               = (known after apply)
+       resource_id             = (known after apply)
+       sensitive_body          = (write-only attribute)
+       type                    = "Microsoft.ContainerService/managedClusters@2024-02-01"
    }

  # module.aks.azurerm_kubernetes_cluster.main will be created
+   resource "azurerm_kubernetes_cluster" "main" {
+       api_server_authorized_ip_ranges     = (known after apply)
+       azure_policy_enabled                = true
+       cost_analysis_enabled               = false
+       current_kubernetes_version          = (known after apply)
+       dns_prefix                          = (known after apply)
+       fqdn                                = (known after apply)
+       http_application_routing_zone_name  = (known after apply)
+       id                                  = (known after apply)
+       image_cleaner_enabled               = false
+       image_cleaner_interval_hours        = 48
+       kube_admin_config                   = (sensitive value)
+       kube_admin_config_raw               = (sensitive value)
+       kube_config                         = (sensitive value)
+       kube_config_raw                     = (sensitive value)
+       kubernetes_version                  = (known after apply)
+       location                            = "eastus"
+       name                                = "aks-otel-ecommerce-dev-eastus"
+       node_resource_group                 = (known after apply)
+       node_resource_group_id              = (known after apply)
+       oidc_issuer_enabled                 = false
+       oidc_issuer_url                     = (known after apply)
+       portal_fqdn                         = (known after apply)
+       private_cluster_enabled             = false
+       private_cluster_public_fqdn_enabled = false
+       private_dns_zone_id                 = (known after apply)
+       private_fqdn                        = (known after apply)
+       public_network_access_enabled       = true
+       resource_group_name                 = "rg-otel-ecommerce-dev-eastus"
+       role_based_access_control_enabled   = false
+       run_command_enabled                 = true
+       sku_tier                            = "Free"
+       support_plan                        = "KubernetesOfficial"
+       workload_identity_enabled           = false

+       api_server_access_profile (known after apply)

+       auto_scaler_profile (known after apply)

+       default_node_pool {
+           enable_auto_scaling    = false
+           enable_host_encryption = false
+           enable_node_public_ip  = false
+           kubelet_disk_type      = (known after apply)
+           max_pods               = 50
+           name                   = "nodepool"
+           node_count             = 1
+           node_labels            = (known after apply)
+           orchestrator_version   = (known after apply)
+           os_disk_size_gb        = 50
+           os_disk_type           = "Managed"
+           os_sku                 = (known after apply)
+           scale_down_mode        = "Delete"
+           type                   = "VirtualMachineScaleSets"
+           ultra_ssd_enabled      = false
+           vm_size                = "Standard_B2ms"
+           workload_runtime       = (known after apply)

+           upgrade_settings {
+               max_surge                     = "10%"
+               node_soak_duration_in_minutes = 0
            }
        }

+       identity {
+           principal_id = (known after apply)
+           tenant_id    = (known after apply)
+           type         = (sensitive value)
        }

+       kubelet_identity (known after apply)

+       network_profile {
+           dns_service_ip          = (known after apply)
+           docker_bridge_cidr      = (known after apply)
+           ebpf_data_plane         = (known after apply)
+           ip_versions             = (known after apply)
+           load_balancer_sku       = "standard"
+           network_data_plane      = (known after apply)
+           network_mode            = (known after apply)
+           network_plugin          = "kubenet"
+           network_policy          = (known after apply)
+           outbound_ip_address_ids = (known after apply)
+           outbound_ip_prefix_ids  = (known after apply)
+           outbound_type           = "loadBalancer"
+           pod_cidr                = (known after apply)
+           pod_cidrs               = (known after apply)
+           service_cidr            = (known after apply)
+           service_cidrs           = (known after apply)

+           load_balancer_profile (known after apply)

+           nat_gateway_profile (known after apply)
        }

+       oms_agent {
+           log_analytics_workspace_id = (known after apply)
+           oms_agent_identity         = (known after apply)
        }

+       windows_profile (known after apply)
    }

  # module.aks.azurerm_log_analytics_solution.main[0] will be created
+   resource "azurerm_log_analytics_solution" "main" {
+       id                    = (known after apply)
+       location              = "eastus"
+       resource_group_name   = "rg-otel-ecommerce-dev-eastus"
+       solution_name         = "ContainerInsights"
+       workspace_name        = (known after apply)
+       workspace_resource_id = (known after apply)

+       plan {
+           name      = (known after apply)
+           product   = "OMSGallery/ContainerInsights"
+           publisher = "Microsoft"
        }
    }

  # module.aks.azurerm_log_analytics_workspace.main[0] will be created
+   resource "azurerm_log_analytics_workspace" "main" {
+       allow_resource_only_permissions = true
+       daily_quota_gb                  = -1
+       id                              = (known after apply)
+       internet_ingestion_enabled      = true
+       internet_query_enabled          = true
+       local_authentication_disabled   = false
+       location                        = "eastus"
+       name                            = (known after apply)
+       primary_shared_key              = (sensitive value)
+       resource_group_name             = "rg-otel-ecommerce-dev-eastus"
+       retention_in_days               = 30
+       secondary_shared_key            = (sensitive value)
+       sku                             = "PerGB2018"
+       workspace_id                    = (known after apply)
    }

  # module.aks.azurerm_monitor_data_collection_rule.dcr[0] will be created
+   resource "azurerm_monitor_data_collection_rule" "dcr" {
+       description         = "DCR for Azure Monitor Container Insights"
+       id                  = (known after apply)
+       immutable_id        = (known after apply)
+       location            = "eastus"
+       name                = "MSCI-eastus-aks-otel-ecommerce-dev-eastus"
+       resource_group_name = "rg-otel-ecommerce-dev-eastus"

+       data_flow {
+           destinations = (known after apply)
+           streams      = [
+               "Microsoft-ContainerLog",
+               "Microsoft-ContainerLogV2",
+               "Microsoft-KubeEvents",
+               "Microsoft-KubePodInventory",
+               "Microsoft-KubeNodeInventory",
+               "Microsoft-KubePVInventory",
+               "Microsoft-KubeServices",
+               "Microsoft-KubeMonAgentEvents",
+               "Microsoft-InsightsMetrics",
+               "Microsoft-ContainerInventory",
+               "Microsoft-ContainerNodeInventory",
+               "Microsoft-Perf",
            ]
        }
+       data_flow {
+           destinations = (known after apply)
+           streams      = [
+               "Microsoft-Syslog",
            ]
        }

+       data_sources {
+           extension {
+               extension_json = jsonencode(
                    {
+                       dataCollectionSettings = {
+                           enableContainerLogV2   = true
+                           interval               = "1m"
+                           namespaceFilteringMode = "Off"
+                           namespaces             = [
+                               "kube-system",
+                               "gatekeeper-system",
+                               "azure-arc",
                            ]
                        }
                    }
                )
+               extension_name = "ContainerInsights"
+               name           = "ContainerInsightsExtension"
+               streams        = [
+                   "Microsoft-ContainerLog",
+                   "Microsoft-ContainerLogV2",
+                   "Microsoft-KubeEvents",
+                   "Microsoft-KubePodInventory",
+                   "Microsoft-KubeNodeInventory",
+                   "Microsoft-KubePVInventory",
+                   "Microsoft-KubeServices",
+                   "Microsoft-KubeMonAgentEvents",
+                   "Microsoft-InsightsMetrics",
+                   "Microsoft-ContainerInventory",
+                   "Microsoft-ContainerNodeInventory",
+                   "Microsoft-Perf",
                ]
            }
+           syslog {
+               facility_names = [
+                   "auth",
+                   "authpriv",
+                   "cron",
+                   "daemon",
+                   "mark",
+                   "kern",
+                   "local0",
+                   "local1",
+                   "local2",
+                   "local3",
+                   "local4",
+                   "local5",
+                   "local6",
+                   "local7",
+                   "lpr",
+                   "mail",
+                   "news",
+                   "syslog",
+                   "user",
+                   "uucp",
                ]
+               log_levels     = [
+                   "Debug",
+                   "Info",
+                   "Notice",
+                   "Warning",
+                   "Error",
+                   "Critical",
+                   "Alert",
+                   "Emergency",
                ]
+               name           = "sysLogsDataSource"
+               streams        = [
+                   "Microsoft-Syslog",
                ]
            }
        }

+       destinations {
+           log_analytics {
+               name                  = (known after apply)
+               workspace_resource_id = (known after apply)
            }
        }
    }

  # module.aks.azurerm_monitor_data_collection_rule_association.dcra[0] will be created
+   resource "azurerm_monitor_data_collection_rule_association" "dcra" {
+       data_collection_rule_id = (known after apply)
+       description             = "Association of container insights data collection rule. Deleting this association will break the data collection for this AKS Cluster."
+       id                      = (known after apply)
+       name                    = "ContainerInsightsExtension"
+       target_resource_id      = (known after apply)
    }

  # module.aks.null_resource.kubernetes_cluster_name_keeper will be created
+   resource "null_resource" "kubernetes_cluster_name_keeper" {
+       id       = (known after apply)
+       triggers = {
+           "name" = "aks-otel-ecommerce-dev-eastus"
        }
    }

  # module.aks.null_resource.kubernetes_version_keeper will be created
+   resource "null_resource" "kubernetes_version_keeper" {
+       id       = (known after apply)
+       triggers = {
+           "version" = null
        }
    }

  # module.aks.time_sleep.interval_before_cluster_update[0] will be created
+   resource "time_sleep" "interval_before_cluster_update" {
+       create_duration = "30s"
+       id              = (known after apply)
    }

  # module.naming.random_string.first_letter will be created
+   resource "random_string" "first_letter" {
+       id          = (known after apply)
+       length      = 1
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = false
+       numeric     = false
+       result      = (known after apply)
+       special     = false
+       upper       = false
    }

  # module.naming.random_string.main will be created
+   resource "random_string" "main" {
+       id          = (known after apply)
+       length      = 60
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (known after apply)
+       special     = false
+       upper       = false
    }

Plan: 13 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   cluster_credentials_download_command = "az aks get-credentials --resource-group rg-otel-ecommerce-dev-eastus --name aks-otel-ecommerce-dev-eastus --overwrite-existing"
```
</details>

:memo: Plan generated in [ci cd #15](https://github.com/HossainAhnaf/otel-ecommerce-infra/actions/runs/16434666486)